---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.StructuralSectionsService
source: html/cbdcebe7-2ef4-d848-6a01-858c2300988d.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.StructuralSectionsService Property

The external service supporting view and modification of the structural sections shape in structural elements.
 The service is still under development and cannot be used. It means that no server can be external registered from it yet.

## Syntax (C#)
```csharp
public static ExternalServiceId StructuralSectionsService { get; }
```